"use client"
import { List, Text } from "@mantine/core"

export default function Rules() {
    return (
        <>
            <Text fz="lg" fw="bold">Правила посещения и рекомендации фестиваля Танибата 2023</Text>
            <Text fw="lighter" mb="lg">15.03.2023</Text>
            <Text mb="md">
                Важная информация для наших будущих зрителей, выступающих, ведущих мини-мероприятий,
                а также волонтёров и участников ярмарки.
            </Text>
            <List>
                <List.Item>
                    Поскольку «Танибата» проводится на территории Ростовской области в Российской Федерации,
                    и все мы хотим, чтобы после него были и другие наши фестивали - оргкомитет настоятельно
                    просит соблюдать законодательство нашей страны, действующее на момент проведения фестиваля.
                    Также есть рекомендации площадки проведения (ОДНТ), к которым стоит прислушаться.
                </List.Item>
                <List.Item>
                    На фестивале «Танибата» не допускается демонстрация обнажённой натуры,
                    пропаганда ЛГБТ, нетрадиционных сексуальных отношений и (или) предпочтений,
                    смены пола; пропаганда наркотиков и их производных, алкоголя и табака;
                    использование политически окрашенной символики, политические призывы и лозунги;
                    проявление чрезмерной агрессии, звуки воздушной тревоги, взрывов и выстрелов в треках,
                    костюмы, напоминающие форму любых действующих/современных войск, полиции etc.,
                    макеты огнестрельного оружия, напоминающие современное; ненормативная лексика
                    и ненормативное поведение, а также любое поведение, слова, образы или символика,
                    которые могут расцениваться как демонстрация вышеупомянутых категорий
                    и нарушать законодательство РФ, включающее, но не ограничивающееся, статьей 6.21 КоАП РФ.
                </List.Item>
                <List.Item>
                    Всё вышеперечисленное относится и к товарам, представленным на ярмарке.
                    Если вы обнаружили что-то запрещённое — пожалуйста, оперативно информируйте организаторов
                    через любого волонтёра.
                </List.Item>
                <List.Item>
                    Напоминаем, что фестиваль имеет общий возрастной рейтинг 12+, и контент 18+ на нём неприемлем.
                </List.Item>
                <List.Item>
                    Вся ответственность за нарушения законодательства РФ, произошедшие со стороны зрителей,
                    участников программы косплей-шоу и концерта, мастер-классов и ярмарки, а также волонтёров,
                    в полном объёме ложится на них.
                </List.Item>
                <List.Item>
                    Тем не менее, мы надеемся на светлый разум и адекватность оценки ситуации со стороны всех,
                    кто как-либо связан с нашими мероприятиями, а также на любовь к ним.
                </List.Item>
            </List>
            <Text mt="md" mb="md">
                Прочие, не менее важные, правила:
            </Text>
            <List type="ordered">
                <List.Item>
                    Пожалуйста, не проносите в здание ОДНТ любые напитки в стеклянной таре, алкоголь, энергетики и предметы,
                    опасные для окружающих и интерьера.
                </List.Item>
                <List.Item>
                    Не пользуйтесь красками, сильно пахнущими клеями и ядовитыми аэрозолями в гримёрках
                    – пожалуйста, выйдите на улицу и подстелите клеенку, чтобы не красить плитку. За это оштрафуют.
                </List.Item>
                <List.Item>
                    Не курите в 15-метровом радиусе от ОДНТ.
                </List.Item>
                <List.Item>
                    Не употребляйте спиртное, не приходите на фестиваль в состоянии алкогольного опьянения.
                </List.Item>
                <List.Item>
                    Не ходите по газонам.
                </List.Item>
                <List.Item>
                    Соблюдайте чистоту, берегите имущество ОДНТ, стены и парапеты площади К.Маркса.
                </List.Item>
                <List.Item>
                    Не оставляйте ценные вещи без присмотра.
                </List.Item>
                <List.Item>
                    Не фотографируйте в Большом Зале со вспышкой. Категорически! А в гримерках - вообще никак не фотографируйте.
                </List.Item>
                <List.Item>
                    Не мешайте другим зрителям наслаждаться шоу, а выступающим – выступать.
                </List.Item>
                <List.Item>
                    Занимайте места на косплей-шоу согласно купленным билетам, не садитесь на чужие.
                </List.Item>
                <List.Item>
                    Помогайте волонтёрам и Службе Безопасности Танибатаа фиксировать нарушения.
                </List.Item>
                <List.Item>
                    Уважайте друг друга, будьте вежливы с другими зрителями, участниками, волонтерами,
                    организаторами и сотрудниками ОДНТ!
                </List.Item>
                <List.Item>
                    Вовремя возвращайтесь с перерывов! Люди, выступающие в начале отделений,
                    не заслужили выхода при неполном зале.
                </List.Item>
            </List>

            <Text mt="lg">
                Также ниже мы приводим рекомендации, которые помогут вам сохранить о фестивале самые наилучшие впечатления.
            </Text>
            <List>
                <List.Item>
                    <Text fw="bold">Обязательно захватите воду или другие безалкогольные напитки</Text>
                    (В ПЛАСТИКЕ ! ДА, их можно проносить в Большой Зал), ручки для заполнения анкет,
                    медикаменты (тем, кому требуется постоянный приём лекарств или кто знает за собой те или иные особенности организма),
                    влажные салфетки, и, конечно же, лучший друг косплеера - КЛЕЙКИЙ СКОТЧ.
                </List.Item>
                <List.Item>
                    Еду проносить тоже разрешается (но не в Большой зал). И важно, чтобы она не пачкала чужую одежду и имущество ОДНТ!
                </List.Item>
                <List.Item>
                    <Text fw="bold">
                        Рекомендуем в этом году брать оригиналы документов, подтверждающих личность, и не терять их.
                    </Text>
                </List.Item>
                <List.Item>
                    Если Вы почувствовали себя плохо, и это неисправимо собственными силами – немедленно обращайтесь к представителям СБ фестиваля постоянное местонахождение - в зрительном зале, рядом с проектором.
                </List.Item>
            </List>

            <Text fz="lg" mt="md" mb="lg">Всем здоровья, безопасности и приятных эмоций от фестиваля!</Text>
        </>
    )
}